### Terraform Plan: Success ✅
---
#### Terraform Format and Style 🚀`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
plan<<gUNovqs/HwSlBDtV/yfa

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ecs_instances.aws_ecs_service.frontend has been deleted
  - resource "aws_ecs_service" "frontend" {
        id                                 = "arn:aws:ecs:us-east-1:904106077871:service/fiap-lumiere-cluster/fiap-lumiere-web-front-service"
      - name                               = "fiap-lumiere-web-front-service" -> null
        tags                               = {}
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.api_gateway.aws_api_gateway_stage.api_gateway_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "api_gateway_stage" {
      ~ deployment_id         = "3wurz3" -> "jmh5y7"
        id                    = "ags-5f8a8c2951-development"
        tags                  = {}
        # (14 unchanged attributes hidden)
    }

  # module.cognito_pools.aws_cognito_user_pool_domain.user_pool_domain will be created
  + resource "aws_cognito_user_pool_domain" "user_pool_domain" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "fiap-lumiere"
      + id                              = (known after apply)
      + managed_login_version           = (known after apply)
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = "us-east-1_TNy71KIOz"
      + version                         = (known after apply)
    }

  # module.ecs_instances.aws_ecs_service.frontend will be created
  + resource "aws_ecs_service" "frontend" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:us-east-1:904106077871:cluster/fiap-lumiere-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "fiap-lumiere-web-front-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:us-east-1:904106077871:task-definition/fiap-lumiere-web-front-task:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "fiap-lumiere-web-front-container"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:904106077871:targetgroup/fiap-lumiere-frontend-tg/5e0642736b1789a8"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-04469dcdd72252c45",
            ]
          + subnets          = [
              + "subnet-03b35475d6c470c23",
              + "subnet-0bef5e68ceca2b0ae",
              + "subnet-0d6a33996e72a29f2",
            ]
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
gUNovqs/HwSlBDtV/yfa
```

</details>

*Pushed by: @WesleySangalli, Action: `pull_request`*